src/InformationRegisters/инкКонфигурацияВыплатВФонды/инкКонфигурацияВыплатВФонды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>инкКонфигурацияВыплатВФонды</name>
  <resources>
    <name>ПФ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФСС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФФОМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СтрокаТарифаВЗН</name>
    <type>
      <types>EnumRef.инкСтрокаТарифаВЗН</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/инкСтрокаТарифаВЗН/инкСтрокаТарифаВЗН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкСтрокаТарифаВЗН</name>
  <enumValues>
    <name>ОблагаемаяБазаВЗН</name>
  </enumValues>
  <enumValues>
    <name>ТарифВПределахЛимита</name>
  </enumValues>
  <enumValues>
    <name>ТарифСверхЛимита</name>
  </enumValues>
  <enumValues>
    <name>ТарифСвышеМРОТДляМСБ</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/инкКонфигурацияВыплатВФонды/ManagerModule.bsl
#Область о //Обновление ИБ:

// Обработчик обновления УТ 11.0.0.6
//
// Первоночальное заполнение.
//
Процедура ПервоночальноеЗаполнение_11_0_0_6() Экспорт
	
	// 2020 год:
	Набор = РегистрыСведений.инкКонфигурацияВыплатВФонды.СоздатьНаборЗаписей();
	Набор.Очистить();
	
	// 		Обл. база на каждого работника с нач. года:
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.СтрокаТарифаВЗН = Перечисления.инкСтрокаТарифаВЗН.ОблагаемаяБазаВЗН;
	Запись.ПФ		= 1292000;
	Запись.ФСС  	= 912000;
	Запись.ФФОМС	= 0;
	
	//		Тариф в пределах лимита:
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.СтрокаТарифаВЗН = Перечисления.инкСтрокаТарифаВЗН.ТарифВПределахЛимита;
	Запись.ПФ		= 22;
	Запись.ФСС  	= 2.9;
	Запись.ФФОМС	= 5.10;
	
	// 		Тариф сверх лимита:
	Запись = Набор.Добавить();
	Запись.Период = Дата("20200101000000");
	Запись.СтрокаТарифаВЗН = Перечисления.инкСтрокаТарифаВЗН.ТарифСверхЛимита;
	Запись.ПФ		= 11;
	Запись.ФСС  	= 1.45;
	Запись.ФФОМС	= 2.55;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
